Тестовая_база_ERP_14/src/Catalogs/КлассыОбъектовЭксплуатации/КлассыОбъектовЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлассыОбъектовЭксплуатации</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуютсяПодклассы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РемонтныйЦиклПоИнтервалуНаработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКлассУзла</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РеквизитыДляКонтроля</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбязателенДляЗаполнения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоказателиНаработки</name>
    <attributes>
      <name>ПоказательНаработки</name>
      <type>
        <types>CatalogRef.ПоказателиНаработки</types>
      </type>
    </attributes>
    <attributes>
      <name>РассчитыватьОстаточныйРесурс</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РегистрироватьОтИсточника</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьРегистрации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПересчитыватьСреднесуточноеЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МинимальныйПериодРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальныйПериодРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РемонтныйЦикл</name>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнтервалВремени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаВремени</name>
      <type>
        <types>EnumRef.ЕдиницыИзмеренияВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнтервалНаработки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательНаработки</name>
      <type>
        <types>CatalogRef.ПоказателиНаработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрочиеРемонты</name>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоИнтервалуНаработки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнтервалВремени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаВремени</name>
      <type>
        <types>EnumRef.ЕдиницыИзмеренияВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнтервалНаработки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательНаработки</name>
      <type>
        <types>CatalogRef.ПоказателиНаработки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/Catalogs/КлассыОбъектовЭксплуатации/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ИспользуютсяПодклассы Тогда
		
		Если РемонтныйЦикл.Количество()<>0 Тогда
			РемонтныйЦикл.Очистить();
		КонецЕсли;
		
		Если ПрочиеРемонты.Количество()<>0 Тогда
			ПрочиеРемонты.Очистить();
		КонецЕсли;
		
	КонецЕсли;
	
	СобственныйНаборСвойств = Истина;
	Если ЗначениеЗаполнено(НаборСвойств) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НаборСвойств", ЭтотОбъект.НаборСвойств);
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КлассыОбъектовЭксплуатации.Ссылка
		|ИЗ
		|	Справочник.КлассыОбъектовЭксплуатации КАК КлассыОбъектовЭксплуатации
		|ГДЕ
		|	КлассыОбъектовЭксплуатации.Ссылка <> &Ссылка
		|	И НЕ КлассыОбъектовЭксплуатации.ПометкаУдаления
		|	И КлассыОбъектовЭксплуатации.НаборСвойств = &НаборСвойств";
		СобственныйНаборСвойств = Запрос.Выполнить().Пустой();
	КонецЕсли;
	Если СобственныйНаборСвойств И ЗначениеЗаполнено(НаборСвойств) Тогда
		
		УправлениеСвойствами.ПередЗаписьюВидаОбъекта(
			ЭтотОбъект,
			?(ЭтоКлассУзла, "Справочник_УзлыОбъектовЭксплуатации", "Справочник_ОбъектыЭксплуатации"));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНеПроверяемыхРеквизитов = Новый Массив;
	
	Если Не ЭтоГруппа Тогда
		
		Если Не ИспользуютсяПодклассы Тогда
			
			// Проверка заполнения правил планирования
			Справочники.КлассыОбъектовЭксплуатации.ПроверкаЗаполненияПравилПланирования(ЭтотОбъект, МассивНеПроверяемыхРеквизитов, Отказ);
			
		КонецЕсли;
		
		МассивНеПроверяемыхРеквизитов.Добавить("ПоказателиНаработки.СреднесуточноеЗначение");
		МассивНеПроверяемыхРеквизитов.Добавить("ПоказателиНаработки.МинимальныйПериодРасчета");
		МассивНеПроверяемыхРеквизитов.Добавить("ПоказателиНаработки.МаксимальныйПериодРасчета");
		
		// Проверка заполнения показателей наработки
		Для ТекИндекс = 0 По ПоказателиНаработки.Количество()-1 Цикл
			
			Строка = ПоказателиНаработки[ТекИндекс];
			
			АдресОшибки = " " + НСтр("ru = 'в строке %НомерСтроки% списка ""Показатели наработки""';
									|en = 'in row %НомерСтроки% of the ""Running time values"" list'");
			АдресОшибки = СтрЗаменить(АдресОшибки, "%НомерСтроки%", ПоказателиНаработки[ТекИндекс].НомерСтроки);
			
			Если Строка.ПересчитыватьСреднесуточноеЗначение Тогда
				
				Если Не ЗначениеЗаполнено(Строка.МинимальныйПериодРасчета) Тогда
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						НСтр("ru = 'Не заполнена колонка ""Минимальный период расчета""';
							|en = 'Fill in the ""Minimum calculation period"" column'") + АдресОшибки,
						ЭтотОбъект,
						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ПоказателиНаработки", ПоказателиНаработки[ТекИндекс].НомерСтроки, "МинимальныйПериодРасчета"),
						,
						Отказ);
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Строка.МаксимальныйПериодРасчета) Тогда
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						НСтр("ru = 'Не заполнена колонка ""Максимальный период расчета""';
							|en = 'Fill in the ""Maximum calculation period"" column'") + АдресОшибки,
						ЭтотОбъект,
						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ПоказателиНаработки", ПоказателиНаработки[ТекИндекс].НомерСтроки, "МаксимальныйПериодРасчета"),
						,
						Отказ);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНеПроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
